## Terraform Plan Output
<details><summary>Click to expand</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # azurerm_linux_virtual_machine.vm-test["vm1"] will be created
  + resource "azurerm_linux_virtual_machine" "vm-test" {
      + admin_password                                         = (sensitive value)
      + admin_username                                         = "kmiszel"
      + allow_extension_operations                             = true
      + bypass_platform_safety_checks_on_user_schedule_enabled = false
      + computer_name                                          = (known after apply)
      + disable_password_authentication                        = false
      + disk_controller_type                                   = (known after apply)
      + extensions_time_budget                                 = "PT1H30M"
      + id                                                     = (known after apply)
      + location                                               = "northeurope"
      + max_bid_price                                          = -1
      + name                                                   = "vm1"
      + network_interface_ids                                  = (known after apply)
      + patch_assessment_mode                                  = "ImageDefault"
      + patch_mode                                             = "ImageDefault"
      + platform_fault_domain                                  = -1
      + priority                                               = "Regular"
      + private_ip_address                                     = (known after apply)
      + private_ip_addresses                                   = (known after apply)
      + provision_vm_agent                                     = true
      + public_ip_address                                      = (known after apply)
      + public_ip_addresses                                    = (known after apply)
      + resource_group_name                                    = "rgtest2"
      + secure_boot_enabled                                    = true
      + size                                                   = "Standard_B1ms"
      + virtual_machine_id                                     = (known after apply)
      + vm_agent_platform_updates_enabled                      = false
      + vtpm_enabled                                           = true

      + additional_capabilities {
          + ultra_ssd_enabled = false
        }

      + os_disk {
          + caching                   = "ReadWrite"
          + disk_size_gb              = (known after apply)
          + name                      = (known after apply)
          + storage_account_type      = "Standard_LRS"
          + write_accelerator_enabled = false
        }

      + source_image_reference {
          + offer     = "0001-com-ubuntu-server-focal"
          + publisher = "canonical"
          + sku       = "20_04-lts-gen2"
          + version   = "latest"
        }
    }

  # azurerm_linux_virtual_machine.vm-test["vm2"] will be created
  + resource "azurerm_linux_virtual_machine" "vm-test" {
      + admin_password                                         = (sensitive value)
      + admin_username                                         = "kmiszel"
      + allow_extension_operations                             = true
      + bypass_platform_safety_checks_on_user_schedule_enabled = false
      + computer_name                                          = (known after apply)
      + disable_password_authentication                        = false
      + disk_controller_type                                   = (known after apply)
      + extensions_time_budget                                 = "PT1H30M"
      + id                                                     = (known after apply)
      + location                                               = "northeurope"
      + max_bid_price                                          = -1
      + name                                                   = "vm2"
      + network_interface_ids                                  = (known after apply)
      + patch_assessment_mode                                  = "ImageDefault"
      + patch_mode                                             = "ImageDefault"
      + platform_fault_domain                                  = -1
      + priority                                               = "Regular"
      + private_ip_address                                     = (known after apply)
      + private_ip_addresses                                   = (known after apply)
      + provision_vm_agent                                     = true
      + public_ip_address                                      = (known after apply)
      + public_ip_addresses                                    = (known after apply)
      + resource_group_name                                    = "rgtest2"
      + secure_boot_enabled                                    = true
      + size                                                   = "Standard_B1ms"
      + virtual_machine_id                                     = (known after apply)
      + vm_agent_platform_updates_enabled                      = false
      + vtpm_enabled                                           = true

      + additional_capabilities {
          + ultra_ssd_enabled = false
        }

      + os_disk {
          + caching                   = "ReadWrite"
          + disk_size_gb              = (known after apply)
          + name                      = (known after apply)
          + storage_account_type      = "Standard_LRS"
          + write_accelerator_enabled = false
        }

      + source_image_reference {
          + offer     = "0001-com-ubuntu-server-focal"
          + publisher = "canonical"
          + sku       = "20_04-lts-gen2"
          + version   = "latest"
        }
    }

  # azurerm_linux_virtual_machine.vm-test["vm3"] will be created
  + resource "azurerm_linux_virtual_machine" "vm-test" {
      + admin_password                                         = (sensitive value)
      + admin_username                                         = "kmiszel"
      + allow_extension_operations                             = true
      + bypass_platform_safety_checks_on_user_schedule_enabled = false
      + computer_name                                          = (known after apply)
      + disable_password_authentication                        = false
      + disk_controller_type                                   = (known after apply)
      + extensions_time_budget                                 = "PT1H30M"
      + id                                                     = (known after apply)
      + location                                               = "northeurope"
      + max_bid_price                                          = -1
      + name                                                   = "vm3"
      + network_interface_ids                                  = (known after apply)
      + patch_assessment_mode                                  = "ImageDefault"
      + patch_mode                                             = "ImageDefault"
      + platform_fault_domain                                  = -1
      + priority                                               = "Regular"
      + private_ip_address                                     = (known after apply)
      + private_ip_addresses                                   = (known after apply)
      + provision_vm_agent                                     = true
      + public_ip_address                                      = (known after apply)
      + public_ip_addresses                                    = (known after apply)
      + resource_group_name                                    = "rgtest2"
      + secure_boot_enabled                                    = true
      + size                                                   = "Standard_B1ms"
      + virtual_machine_id                                     = (known after apply)
      + vm_agent_platform_updates_enabled                      = false
      + vtpm_enabled                                           = true

      + additional_capabilities {
          + ultra_ssd_enabled = false
        }

      + os_disk {
          + caching                   = "ReadWrite"
          + disk_size_gb              = (known after apply)
          + name                      = (known after apply)
          + storage_account_type      = "Standard_LRS"
          + write_accelerator_enabled = false
        }

      + source_image_reference {
          + offer     = "0001-com-ubuntu-server-focal"
          + publisher = "canonical"
          + sku       = "20_04-lts-gen2"
          + version   = "latest"
        }
    }

  # azurerm_network_interface.vmnic-test["vm1"] will be created
  + resource "azurerm_network_interface" "vmnic-test" {
      + applied_dns_servers           = (known after apply)
      + dns_servers                   = (known after apply)
      + enable_accelerated_networking = false
      + enable_ip_forwarding          = false
      + id                            = (known after apply)
      + internal_dns_name_label       = (known after apply)
      + internal_domain_name_suffix   = (known after apply)
      + location                      = "northeurope"
      + mac_address                   = (known after apply)
      + name                          = "vm1-nic"
      + private_ip_address            = (known after apply)
      + private_ip_addresses          = (known after apply)
      + resource_group_name           = "rgtest2"
      + virtual_machine_id            = (known after apply)

      + ip_configuration {
          + gateway_load_balancer_frontend_ip_configuration_id = (known after apply)
          + name                                               = "ipconfig1"
          + primary                                            = (known after apply)
          + private_ip_address                                 = (known after apply)
          + private_ip_address_allocation                      = "Dynamic"
          + private_ip_address_version                         = "IPv4"
          + subnet_id                                          = "/subscriptions/456fb512-af18-4d07-861c-3ee54eae9181/resourceGroups/rgtest2/providers/Microsoft.Network/virtualNetworks/vnet-test/subnets/default"
        }
    }

  # azurerm_network_interface.vmnic-test["vm2"] will be created
  + resource "azurerm_network_interface" "vmnic-test" {
      + applied_dns_servers           = (known after apply)
      + dns_servers                   = (known after apply)
      + enable_accelerated_networking = false
      + enable_ip_forwarding          = false
      + id                            = (known after apply)
      + internal_dns_name_label       = (known after apply)
      + internal_domain_name_suffix   = (known after apply)
      + location                      = "northeurope"
      + mac_address                   = (known after apply)
      + name                          = "vm2-nic"
      + private_ip_address            = (known after apply)
      + private_ip_addresses          = (known after apply)
      + resource_group_name           = "rgtest2"
      + virtual_machine_id            = (known after apply)

      + ip_configuration {
          + gateway_load_balancer_frontend_ip_configuration_id = (known after apply)
          + name                                               = "ipconfig1"
          + primary                                            = (known after apply)
          + private_ip_address                                 = (known after apply)
          + private_ip_address_allocation                      = "Dynamic"
          + private_ip_address_version                         = "IPv4"
          + subnet_id                                          = "/subscriptions/456fb512-af18-4d07-861c-3ee54eae9181/resourceGroups/rgtest2/providers/Microsoft.Network/virtualNetworks/vnet-test/subnets/default"
        }
    }

  # azurerm_network_interface.vmnic-test["vm3"] will be created
  + resource "azurerm_network_interface" "vmnic-test" {
      + applied_dns_servers           = (known after apply)
      + dns_servers                   = (known after apply)
      + enable_accelerated_networking = false
      + enable_ip_forwarding          = false
      + id                            = (known after apply)
      + internal_dns_name_label       = (known after apply)
      + internal_domain_name_suffix   = (known after apply)
      + location                      = "northeurope"
      + mac_address                   = (known after apply)
      + name                          = "vm3-nic"
      + private_ip_address            = (known after apply)
      + private_ip_addresses          = (known after apply)
      + resource_group_name           = "rgtest2"
      + virtual_machine_id            = (known after apply)

      + ip_configuration {
          + gateway_load_balancer_frontend_ip_configuration_id = (known after apply)
          + name                                               = "ipconfig1"
          + primary                                            = (known after apply)
          + private_ip_address                                 = (known after apply)
          + private_ip_address_allocation                      = "Dynamic"
          + private_ip_address_version                         = "IPv4"
          + subnet_id                                          = "/subscriptions/456fb512-af18-4d07-861c-3ee54eae9181/resourceGroups/rgtest2/providers/Microsoft.Network/virtualNetworks/vnet-test/subnets/default"
        }
    }

  # azurerm_network_security_group.nsg-test will be destroyed
  # (because azurerm_network_security_group.nsg-test is not in configuration)
  - resource "azurerm_network_security_group" "nsg-test" {
      - id                  = "/subscriptions/456fb512-af18-4d07-861c-3ee54eae9181/resourceGroups/rgtest2/providers/Microsoft.Network/networkSecurityGroups/vmtest-nsg" -> null
      - location            = "northeurope" -> null
      - name                = "vmtest-nsg" -> null
      - resource_group_name = "rgtest2" -> null
      - security_rule       = [] -> null
      - tags                = {} -> null
    }

  # azurerm_public_ip.pip-test will be destroyed
  # (because azurerm_public_ip.pip-test is not in configuration)
  - resource "azurerm_public_ip" "pip-test" {
      - allocation_method       = "Static" -> null
      - ddos_protection_mode    = "VirtualNetworkInherited" -> null
      - id                      = "/subscriptions/456fb512-af18-4d07-861c-3ee54eae9181/resourceGroups/rgtest2/providers/Microsoft.Network/publicIPAddresses/vmtest-ip" -> null
      - idle_timeout_in_minutes = 4 -> null
      - ip_address              = "13.74.85.79" -> null
      - ip_tags                 = {} -> null
      - ip_version              = "IPv4" -> null
      - location                = "northeurope" -> null
      - name                    = "vmtest-ip" -> null
      - resource_group_name     = "rgtest2" -> null
      - sku                     = "Standard" -> null
      - sku_tier                = "Regional" -> null
      - tags                    = {} -> null
      - zones                   = [] -> null
        # (1 unchanged attribute hidden)
    }

Plan: 6 to add, 0 to change, 2 to destroy.
```
</details>